app/Http/Controllers/Dosen/PerwalianController.php

select * from `mahasiswa` where `nip_dosen` = '199112092024061001' limit 10 offset 20
select count(*) as aggregate from `mahasiswa` where `nip_dosen` = '199112092024061001'
---
    public function index(Request $request)
    {
        $user = Auth::user(); // User yang login
        $dosen = $user->dosen; // Relasi ke dosen berdasarkan email

        if (!$dosen) {
            return redirect()->route('login')->with('error', 'Data dosen tidak ditemukan.');
        }

        // Mengambil parameter dari request
        $angkatan = $request->input('angkatan');
        $search = $request->input('search');
        $perPage = $request->input('per_page', 10); // default 10 jika tidak ada input 'per_page'

        // Ambil mahasiswa berdasarkan nip_dosen dosen yang login, dengan pagination
        $mahasiswa = Mahasiswa::where('nip_dosen', $dosen->nip_dosen)
            ->when($angkatan, function ($query, $angkatan) {
                return $query->where('angkatan', $angkatan);
            })
            ->when($search, function ($query, $search) {
                return $query->where('nama_mhs', 'like', '%' . $search . '%');
            })
            ->paginate($perPage);

select * from `semester_aktif` where `nim` = '24060122140999' and `is_active` = 1 order by `tahun_akademik` desc limit 1
---
        // Loop untuk menghitung SKS Diambil dan menentukan Status
        foreach ($mahasiswa as $mhs) {
            // Cek semester aktif terakhir
            $semesterAktif = SemesterAktif::where('nim', $mhs->nim)
                ->where('is_active', 1)  // Semester yang sedang aktif
                ->latest('tahun_akademik') // Ambil semester terakhir
                ->first();

select distinct `angkatan` from `mahasiswa` where `nip_dosen` = '199112092024061001'
---
        }

        // Ambil angkatan unik
        $angkatanList = Mahasiswa::where('nip_dosen', $dosen->nip_dosen)
            ->select('angkatan')
            ->distinct()
            ->pluck('angkatan');

select * from `semester_aktif` where `nim` = '24060122140999' and `status` = 'Aktif' and `is_active` = 0 order by `tahun_akademik` desc limit 1
---
    private function hitungIPLalu($nim)
    {
        // Ambil semester aktif terakhir berdasarkan NIM
        $semesterAktif = SemesterAktif::where('nim', $nim)
            ->where('status', 'Aktif') // Semester yang statusnya aktif
            ->where('is_active', 0)    // Semester yang is_active = 0
            ->latest('tahun_akademik') // Ambil semester yang paling terakhir
            ->first();

select * from `matakuliah` where `kode_mk` = 'PAIK6406' limit 1
---
            }

            // Ambil SKS mata kuliah yang diambil dari IRS
            $matakuliah = MataKuliah::where('kode_mk', $ir->kode_mk)->first();

select * from `semester_aktif` where `nim` = '24060122140999' and `status` = 'Aktif' and `is_active` = 0
---
    private function hitungIPK($nim)
    {
        // Ambil semua semester yang sudah selesai (is_active = 0) berdasarkan NIM
        $semesterAktif = SemesterAktif::where('nim', $nim)
            ->where('status', 'Aktif') // Semester yang statusnya aktif
            ->where('is_active', 0) // Semester yang sudah selesai
            ->get(); // Ambil semua semester yang sudah selesai

select * from `matakuliah` where `kode_mk` = 'PAIK6102' limit 1
---
                }

                // Ambil SKS mata kuliah yang diambil dari IRS
                $matakuliah = MataKuliah::where('kode_mk', $ir->kode_mk)->first();

select * from `mahasiswa` where `nim` = '24060122140999' limit 1
select * from `semester_aktif` where `nim` = '24060122140999' and `is_active` = 1 limit 1
---
    public function show($nim)
    {
        // Ambil data mahasiswa beserta program studi yang terkait
        $mahasiswa = Mahasiswa::with('programStudi')->where('nim', $nim)->firstOrFail();

        // Ambil data semester aktif berdasarkan NIM mahasiswa
        $semesterAktif = SemesterAktif::where('nim', $nim)
            ->where('is_active', 1) // Pastikan semester aktif
            ->first(); // Ambil yang pertama atau yang terbaru

select * from `semester_aktif` where `nim` = '24060122140999' order by `tahun_akademik` asc
select * from `ruang` where `ruang`.`id` in (1, 2, 3, 5, 9, 10, 11)
select * from `waktu` where `waktu`.`id` in (2, 3, 5, 7, 9)
---
    private function accordionData($nim)
    {
        // Ambil semua semester aktif mahasiswa berdasarkan NIM
        $semesterAktif = SemesterAktif::where('nim', $nim)
            ->orderBy('tahun_akademik', 'asc')
            ->get();

        // Ambil semester terbaru yang is_active = 1
        $semesterTerbaru = $semesterAktif->firstWhere('is_active', 1);

        // Cek apakah semester terbaru sudah memiliki IRS
        $hasIRS = false;
        $semesterAktifData = []; // Menyimpan data semester aktif dengan jumlah SKS

        if ($semesterTerbaru) {
            $hasIRS = IRS::where('id_TA', $semesterTerbaru->id)->exists();
        }

        // Loop untuk menghitung total SKS per semester
        foreach ($semesterAktif as $semester) {
            // Cek apakah semester ini memiliki IRS
            $irs = IRS::with([
                'matakuliah',
                'jadwal',
                'jadwal.ruang', // Ruang terkait dengan jadwal
                'jadwal.waktu',
                'matakuliah.dosen' // Dosen yang mengampu mata kuliah
            ])
                ->where('id_TA', $semester->id)
                ->get();

select * from `matakuliah` where `kode_mk` = 'PAIK6102' limit 1
---
            // Hitung total SKS untuk semester ini
            $totalSKS = 0;
            foreach ($irs as $ir) {
                $mataKuliah = MataKuliah::where('kode_mk', $ir->kode_mk)->first();